In [1]:
import numpy as np 
import pandas as pd
import seaborn as sns

In [2]:
# 1. 다음의 표를 데이터프레임으로 작성하시오.
# id	age	sex 	height	weight
# 1	21	'남'	175	80
# 2	22	'여'	165	55
# 3	31	'여'	155	45
# 4	40	'여'	160	50

In [3]:
age=[21, 22, 31, 40]
sex=['남', '여', '여', '여']
height=[175, 165, 155, 160]
weight=[80, 55, 45 ,50]

df=pd.DataFrame({
    'age':age,
    'sex':sex,
    'height':height,
    'weight':weight,
}, index=range(1,5))

In [4]:
df

   age sex  height  weight
1   21   남     175      80
2   22   여     165      55
3   31   여     155      45
4   40   여     160      50

In [5]:
# 2. gapminder.tsv파일을 읽고 다음 작업을 진행하시오
# (read_csv를 사용하되, sep=\t로 설정하여 읽을 것)

# -자료 크기, 차원, 컬럼, 타입 등 읽어들인 자료의 구조를 확인하시오
# -국가명, 대륙명, 연도 열을 추출하시오
# -lifeExp(기대수명),pop(인구),gdp(소득)의 최대/최소/평균/표준편차

In [6]:
df = pd.read_csv('e:/data/gapminder.tsv', sep='\t')

In [7]:
df.shape

(1704, 6)

In [8]:
df.size

10224

In [9]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [10]:
df.dtypes

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [12]:
df.describe()

             year      lifeExp           pop      gdpPercap
count  1704.00000  1704.000000  1.704000e+03    1704.000000
mean   1979.50000    59.474439  2.960121e+07    7215.327081
std      17.26533    12.917107  1.061579e+08    9857.454543
min    1952.00000    23.599000  6.001100e+04     241.165877
25%    1965.75000    48.198000  2.793664e+06    1202.060309
50%    1979.50000    60.712500  7.023596e+06    3531.846989
75%    1993.25000    70.845500  1.958522e+07    9325.462346
max    2007.00000    82.603000  1.318683e+09  113523.132900

In [13]:
df.country

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [14]:
df.continent

0         Asia
1         Asia
2         Asia
3         Asia
4         Asia
         ...
1699    Africa
1700    Africa
1701    Africa
1702    Africa
1703    Africa
Name: continent, Length: 1704, dtype: object

In [15]:
df.year

0       1952
1       1957
2       1962
3       1967
4       1972
        ...
1699    1987
1700    1992
1701    1997
1702    2002
1703    2007
Name: year, Length: 1704, dtype: int64

In [16]:
for column in ['lifeExp', 'pop', 'gdpPercap']:
    print(f'{column}의 max : {df[column].max():.2f}')
    print(f'{column}의 min : {df[column].min():.2f}')
    print(f'{column}의 mean : {df[column].mean():.2f}')
    print(f'{column}의 std : {df[column].std():.2f}')
    print()

lifeExp의 max : 82.60
lifeExp의 min : 23.60
lifeExp의 mean : 59.47
lifeExp의 std : 12.92

pop의 max : 1318683096.00
pop의 min : 60011.00
pop의 mean : 29601212.32
pop의 std : 106157896.74

gdpPercap의 max : 113523.13
gdpPercap의 min : 241.17
gdpPercap의 mean : 7215.33
gdpPercap의 std : 9857.45

In [17]:
# 3. 다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하시오.
# data = {
#     "국어": [80, 90, 70, 30],
#     "영어": [90, 70, 60, 40],
#     "수학": [90, 60, 80, 70],
# }
# columns = ["국어", "영어", "수학"]
# index = ["춘향", "몽룡", "향단", "방자"]
# df = pd.DataFrame(data, index=index, columns=columns)

# (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
# (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
# (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
# (5) 춘향의 점수를 데이터프레임으로 나타낸다.
# (6) 향단의 점수를 시리즈로 나타낸다.

In [18]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns);df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [19]:
# (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
df.수학.values

array([90, 60, 80, 70], dtype=int64)

In [20]:
# (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [21]:
# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
def avgScore(gr):
    avgScore=[]
    for i in range(4):
        avg=gr.iloc[i].values.mean()
        avgScore.append(avg)

    gr['평균점수']=avgScore

In [22]:
avgScore(df);df

    국어  영어  수학       평균점수
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

In [23]:
# (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
df['영어'] = [90, 70,80, 40]
avgScore(df)

In [24]:
df

    국어  영어  수학       평균점수
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  80  80  75.000000
방자  30  40  70  46.666667

In [25]:
# (5) 춘향의 점수를 데이터프레임으로 나타낸다.
df.loc[['춘향']]

    국어  영어  수학       평균점수
춘향  80  90  90  86.666667

In [26]:
# (6) 향단의 점수를 시리즈로 나타낸다.
df.loc['향단']

국어      70.0
영어      80.0
수학      80.0
평균점수    75.0
Name: 향단, dtype: float64

In [27]:
# 4.  제공된 파일중 scientists.csv 파일을 읽고, 다음 작업을 진행하시오
# -나이 최대값
# -나이 평균
# -나이 평균보다 큰 나이 값을 모두 출력
# -나이에 2를 곱한 값으로 'ages2' 열 추가

In [28]:
scientists=pd.read_csv('e:/data/scientists.csv')
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [29]:
# -나이 최대값
scientists.Age.max()

90

In [30]:
# -나이 평균
scientists.Age.mean()

59.125

In [31]:
# -나이 평균보다 큰 나이 값을 모두 출력
scientists[scientists.Age > scientists.Age.mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [44]:
# -나이에 2를 곱한 값으로 'ages2' 열 추가
scientists['age2'] = scientists.Age*2

In [45]:
scientists

                   Name        Born        Died  Age          Occupation  age2
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist    74
1        William Gosset  1876-06-13  1937-10-16   61        Statistician   122
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse   180
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist   132
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist   112
5             John Snow  1813-03-15  1858-06-16   45           Physician    90
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist    82
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician   154

In [34]:
# 5.
# -타이타닉호 승객의 평균 나이를 구하시오.
# -타이타닉호 승객중 여성 승객의 평균 나이를 구하시오.
# -타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하시오.
# -타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 
# titanic 데이터프레임을 고치시오.

In [35]:
titanic=sns.load_dataset('titanic')

In [36]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [37]:
# -타이타닉호 승객의 평균 나이를 구하시오.
titanic.age.mean()

29.69911764705882

In [38]:
# -타이타닉호 승객중 여성 승객의 평균 나이를 구하시오.
titanic[titanic.sex == 'female'].age.mean()

27.915708812260537

In [39]:
# -타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하시오.
titanic[(titanic.pclass == 1) & (titanic.sex == 'female')].age.mean()

34.61176470588235

In [40]:
# -타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 
# titanic 데이터프레임을 고치시오.
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [41]:
titanic.age=titanic.age.fillna(titanic.age.mean())

In [42]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.000000,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [43]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB